app/Models/secondary/form/ScanModel.php

    public function deleteScanWithDetails($id_scan)
{
    // Iniciar una transacción para asegurar que todas las eliminaciones se completen correctamente
    $this->db->transStart();

    // Obtener los registros de 'scan_details' asociados al escaneo a eliminar
    $scanDetails = $this->db->table('scan_details')->where('id_scan', $id_scan)->get()->getResultArray();

    if ($scanDetails) {
        foreach ($scanDetails as $detail) {
            // Verificar si el dispositivo relacionado existe antes de intentar eliminar puertos
            if (isset($detail['id_devices'])) {
                // Obtener los registros de análisis de puertos ('port_analysis') asociados al dispositivo
                $portAnalysisRecords = $this->db->table('port_analysis')->where('id_devices', $detail['id_devices'])->get()->getResultArray();

                foreach ($portAnalysisRecords as $portAnalysis) {
                    if (isset($portAnalysis['id_port'])) {
                        // Obtener los detalles del puerto asociados al análisis desde la tabla 'port_details'
                        $portDetailsRecords = $this->db->table('port_details')->where('id_analysis', $portAnalysis['id_analysis'])->get()->getResultArray();

                        foreach ($portDetailsRecords as $portDetail) {
                            if (isset($portDetail['id_solution'])) {
                            // Verificar y eliminar soluciones relacionadas en la tabla 'solution'
                                $this->db->table('solution')->where('id_solution', $portDetail['id_solution'])->delete();
                            }
                        }

                        // Eliminar los detalles del puerto desde 'port_details' una vez eliminadas las soluciones
                        $this->db->table('port_details')->where('id_analysis', $portAnalysis['id_analysis'])->delete();
---
SELECT *
FROM `port_details`
WHERE `id_analysis` = '1'
DELETE FROM `solution`
WHERE `id_solution` = '1'
DELETE FROM `port_details`
WHERE `id_analysis` = '1'

            }

            // Eliminar el dispositivo desde la tabla 'devices'
            $this->db->table('devices')->where('id_devices', $detail['id_devices'])->delete();
---
DELETE FROM `devices`
WHERE `id_devices` = '1'