app/Models/secondary/form/ScanModel.php

    public function getScanDetailsByUser($id_user)
    {
        return $this->db->table('scan')
            ->select('scan.*, users.name AS user_name, network.signal, network.essid,
            network.bssid, security_type.type AS security_type, devices.ip_address,
            devices.operating_system, devices.mac_address, ports.port_name, ports.service,
            ports.protocol, port_status.status,solution.solution, solution.vulnerability_code,
            solution.vuln_description, network.channel')
            ->join('users', 'users.id_user = scan.id_user')
            ->join('network', 'network.id_network = scan.id_network')
            ->join('scan_details', 'scan_details.id_scan = scan.id_scan')
            ->join('devices', 'devices.id_devices = scan_details.id_devices')
            ->join('port_analysis', 'port_analysis.id_devices = devices.id_devices')
            ->join('ports', 'ports.id_port = port_analysis.id_port')
            ->join('port_status', 'port_status.id_port_status = ports.id_port_status')
            ->join('solution', 'solution.id_solution = port_analysis.id_solution')
            ->join('security_type', 'security_type.id_security_type = network.id_security_type')
            ->where('scan.id_user', $id_user)
            ->get()
            ->getResultArray();
---
SELECT `scan`.*, `users`.`name` AS `user_name`, `network`.`signal`, `network`.`essid`, `network`.`bssid`, `security_type`.`type` AS `security_type`, `devices`.`ip_address`, `devices`.`operating_system`, `devices`.`mac_address`, `ports`.`port_name`, `ports`.`service`, `ports`.`protocol`, `port_status`.`status`, `solution`.`vulnerability_code`, `solution`.`vuln_description`, `network`.`channel`
FROM `scan`
JOIN `users` ON `users`.`id_user` = `scan`.`id_user`
JOIN `network` ON `network`.`id_network` = `scan`.`id_network`
JOIN `scan_details` ON `scan_details`.`id_scan` = `scan`.`id_scan`
JOIN `devices` ON `devices`.`id_devices` = `scan_details`.`id_devices`
JOIN `port_analysis` ON `port_analysis`.`id_devices` = `devices`.`id_devices`
JOIN `ports` ON `ports`.`id_port` = `port_analysis`.`id_port`
JOIN `port_status` ON `port_status`.`id_port_status` = `ports`.`id_port_status`
JOIN `port_details` ON `port_details`.`id_analysis` = `port_analysis`.`id_analysis`
JOIN `solution` ON `solution`.`id_solution` = `port_details`.`id_solution`
JOIN `security_type` ON `security_type`.`id_security_type` = `network`.`id_security_type`
WHERE `scan`.`id_user` = '1'

    public function deleteScanDetails($id_scan)
    {
        // Eliminar los detalles del escaneo primero para evitar bloqueos o dependencias
        return $this->db->table('scan_details')->where('id_scan', $id_scan)->delete();
---
SELECT *
FROM `scan_details`
WHERE `id_scan` = '1'
DELETE FROM `scan_details`
WHERE `id_scan` = '1'

    public function deleteScanWithDetails($id_scan)
    {
        // Iniciar la transacción
        $this->db->transStart();

        // Obtener los detalles de escaneo para eliminar datos relacionados
        $scanDetails = $this->db->table('scan_details')->where('id_scan', $id_scan)->get()->getResultArray();

        if ($scanDetails) {
            foreach ($scanDetails as $detail) {
                // Eliminar puertos relacionados desde la tabla port_analysis
                if (isset($detail['id_devices'])) {
                    $portAnalysisRecords = $this->db->table('port_analysis')->where('id_devices', $detail['id_devices'])->get()->getResultArray();

                    foreach ($portAnalysisRecords as $portAnalysis) {
                        if (isset($portAnalysis['id_port'])) {
                            $this->db->table('ports')->where('id_port', $portAnalysis['id_port'])->delete();
                        }

                        if (isset($portAnalysis['id_port_status'])) {
                            $this->db->table('port_status')->where('id_port_status', $portAnalysis['id_port_status'])->delete();
                        }
                    }

                    // Eliminar los análisis de puertos relacionados
                    $this->db->table('port_analysis')->where('id_devices', $detail['id_devices'])->delete();
                }

                // Eliminar dispositivos relacionados
                $this->db->table('devices')->where('id_devices', $detail['id_devices'])->delete();
---
SELECT *
FROM `scan_details`
WHERE `id_scan` = '1'
SELECT *
FROM `port_analysis`
WHERE `id_devices` = '1'
DELETE FROM `ports`
WHERE `id_port` = '1'
DELETE FROM `port_analysis`
WHERE `id_devices` = '1'
DELETE FROM `devices`
WHERE `id_devices` = '1'

        }

        // Eliminar los detalles del escaneo
        $this->deleteScanDetails($id_scan);

        // Obtener el id_network desde la tabla scan
        $scan = $this->db->table('scan')->where('id_scan', $id_scan)->get()->getRowArray();

        if ($scan && isset($scan['id_network'])) {
            $this->db->table('network')->where('id_network', $scan['id_network'])->delete();
        }

        // Eliminar el escaneo
        $this->db->table('scan')->where('id_scan', $id_scan)->delete();
---
DELETE FROM `scan`
WHERE `id_scan` = '1'
SELECT *
FROM `scan`
WHERE `id_scan` = '1'
DELETE FROM `network`
WHERE `id_network` = '1'