app/Models/secondary/form/Scan_detailsModel.php

 public function insertDetails($detailsdat){

    $this->insert($detailsdat);
---
INSERT INTO `scan_details` (`id_scan`, `id_devices`) VALUES (52, 49)