app/Models/secondary/form/UserModel.php

SELECT `id_user`, `name`, `email`, `password`, `created_at`, `verification`
FROM `users`
WHERE `email` = 'tiago@gmail.com'
 LIMIT 1
---
    public function getUserByEmail($email)
    {
        return $this->select("id_user, name, email, password, created_at,verification")
            ->where("email", $email)
            ->first();