app/Models/tertiary/network/DeviceModel.php

public function insertDevice($devicedat){

    $this->insert($devicedat);
---
INSERT INTO `devices` (`ip_address`, `mac_address`, `operating_system`) VALUES ('N/A', 'N/A', 'N/A')